{
  "author": "Elena Teneta",
  "domains": ["dev_quality_assurance", "user_research_design"],
  "authorImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/5fb3ceed7e198b53d88e7f91_teneta.jpg",
  "language": "en",
  "bgImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/5f69bd089c3bd8585265a2bd_art-2.jpg",
  "title": "Career Path for a Flat-structured Сompany",
  "position": "HR",
  "date": "Thu Apr 09 2020 13:58:54 GMT+0000 (Coordinated Universal Time)",
  "content": "<div>\n    <p>A flat-structured company we're going to talk about is us, your humble servant, Valor Software. In this\n        article, we want to share with you our direct experience in building a continuous growth system based on a tool\n        called Career Path and implementing it in both our company and Renaizant - the app we developed. But let's\n        start with the backstory of why we decided to delve into building the career growth management system.&nbsp <br>\n    </p>\n    <p>We're still a growing company of less than 100 employees but have the ambition to be proactive and want to\n        escape \"<a href=\" https://www.mgtsystems.com/growing-pains\">growing pains</a>\", especially related to our\n        main value-people and their development:<br></p>\n    <ol>\n        <li>We started with a focus on <a href=\" http://www.reinventingorganizationswiki.com/Teal_Organizations\">the\n            teal</a> organizational structure, the flattest one. Such a structure implies the absence of a job\n            hierarchy: we are all one team, and we flexibly unite to solve work tasks. However, even in the flattest\n            structure, employees have different levels of expertise and sets of soft skills, and should be able to\n            handle tasks of varying complexity. The process of choosing the most suitable performer for each role became\n            an issue.<br></li>\n    </ol>\n    <ol start=\" 2\n    \">\n    <li>A certain gap was found between continuous development and the lack of monitoring tools and rewards for\n        professional growth. In other words, our compensation system didn't look like a system that transparently\n        links the growth of expertise with salary growth.<br></li>\n    </ol>\n    <ol start=\" 3\n    \">\n    <li>In time, it became apparent that we need to coordinate the directions of individual growth with the goals and\n        needs of the organization: the company is ready to invest in the knowledge that is demanded by business. For\n        this, we need to somehow formulate and convey to our employees our expectations.&nbsp <br></li>\n    </ol>\n    <ol start=\" 4\n    \">\n    <li>We prefer to pick employees for new roles internally, rather than spending time and money to hire ones from the\n        labor market. Thus, we needed to keep the number of open positions transparent for employees. Besides, in this\n        case, employees can consider trending jobs first.<br></li>\n    </ol><p>While the company is small (up to 50 employees), you can try to manage these issues \"manually\", with\n    everything in plain sight. With the growth of the organization, there's an increasing need for some kind of\n    objective tool which will help you speed up and refine the processes.&nbsp <br></p>\n    <p>We consider the emerging challenges as a call to create a \"dashboard\" available to all members of the\n        organization while keeping the beloved teal approach. Let's see how it can be done.</p>\n    <h2>How to apply Career Path for a small-sized company. Our experience</h2>\n    <p>We started to work in this direction four years ago. First, we introduced the practice of regular Performance\n        Reviews with the main focus on the employees' development. With each employee, we agree on goals for the\n        upcoming period, usually a half a year, and discuss a review of their compensation, taking into account the\n        achievement of these goals. In parallel, from review to review, we formed and filled in our Competency Matrix,\n        which describes our actual technological stack. However, these tools were rather isolated, cumbersome to use,\n        and, most importantly, they didn't give us a clear visual picture as a result.<br></p>\n    <p>We wanted to have a tool to help each employee simulate their career path in the organization and get a road map\n        of movement along this path in a few clicks. We needed a tool that combines a system of bands and grades with a\n        Competency Matrix. And, since we didn't find such existing tools on the market, we decided to create it\n        ourselves :)<br></p>\n    <p>For starters, we grouped all available and planned positions \"from top to bottom\":<br></p>\n    <ul>\n        <li>Firstly, in <strong>career tracks</strong>-directions an employee can move a career in. Usually, companies\n            apply at least two career tracks-managerial and individual contributor.\n        </li>\n        <li>Then, in <strong>job families</strong>-according to the field of work and core responsibilities: HR and\n            recruiters as part of HR and so on.&nbsp\n        </li>\n        <li>Within each function, we positioned jobs sequentially according to the level of expertise like a trainee,\n            junior, middle, senior to form <strong>bands</strong>-ranges of compensation given to groupings of\n            jobs.&nbsp <br>вЂЌ<em>As expected, the chains of jobs turned out to be of different lengths: for example,\n                for the CEO, there is no concept of \"trainee\", and the QA chain ends at the Lead level.</em></li>\n    </ul>\n    <ul>\n        <li>Next, we determined <strong>grades</strong>-the mediate points within each band, providing a variety of\n            seniority sublevels. For example, grades for middle level could be Middle-, Middle, Middle+.<br></li>\n    </ul>\n    <p>Then we needed to put everything in one system. How could we put different-type positions from all job families\n        together? Of course, we used the data from the labor market. Also, we referred to the point job evaluation\n        method to rank and order all jobs considering the specifics of all jobs in our company.<br></p>\n    <p>The point method helped to dig deeper into the job evaluation. When using this method, the content of jobs can be\n        described in terms of the key qualities of a job. Each factor is assigned points according to the extent to\n        which that particular factor is presented in the job. The more points you assign to a job, the more worth the\n        job has to the organization, thus, compensated more. There may be a group of factors for all jobs, various jobs\n        separately, or a combination of companywide and position-specific factors. The most popular point method is <a\n                href=\" https://en.wikipedia.org/wiki/Hay_Guide_Chart\">the Hay system</a>.<br></p>\n    <p>Having evaluated the jobs, we placed all the chains in a single table:<br></p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1175px\">\n    <div><img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/5e9571b719faa77fab57695c_yAHtJUenv-xEkt6sxGtlmEwVffUsez8JbxwVB_qPxMxKl8rD2Xg_yih0vpTd1MzEiWW5fnxNBRdEBigQraLFqRoO4HyY0Wd0MPw7qWoh25qjVCmtnTf3iWB3Q7L3_RvGidKG5MGG.png\">\n    </div>\n    <figcaption><em>An example of presenting a company's hierarchy when jobs are grouped into career tracks and job\n        families and positioned according to bands &amp grades classification.</em></figcaption>\n    </figure><p>As a result, we got a \"skeleton\" of our system in the form of bands and grades.<br></p>\n    <p>The system of bands and grades is mainly used to manage compensation. For now, we leave this aspect beyond the\n        Renaizant functionality and focus on our goal-using Renaizant to manage development and career.<br></p>\n    <p>The next step was adding the info on the required experience and open seats for each job, so each employee could\n        see their place in the overall picture, along with the nearest available positions and a possible endpoint to\n        visualize their career.&nbsp <br></p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1333px\">\n    <div><img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/5e9571b8b0a7137b6ee70f29_qLKO7fGfJxdSx7D1gaJXDAKLCthFfTkYzdTu2DZjru8UrEBHWWiZONMGr-GjuyUxTgfQ7lKCQOFEl2aaOLdXJeGIQuvD-3VWdJVAt1e-K1jeVttq6YbQ7avHBOyhD7b7a8VW7OYh.png\">\n    </div>\n    <figcaption><em>Adding more details to let employees find the right next role for them: info on each job and\n        potential next positions.</em></figcaption>\n    </figure><p>Finally, for now, we identified and attached the required skills to each position. Now, this is not just\n    a linear diagram but a full-fledged roadmap showing:<br></p>\n    <ul>\n        <li><strong>Point A</strong>. The starting point-employee's current position with an assessment of their\n            skills and skills for this position.\n        </li>\n        <li><strong>Point B</strong>. The closest logical position-the next position within the current job family and\n            the assessment of employee's readiness to occupy it.\n        </li>\n        <li><strong>Point C</strong>. Any desired position along with the required skills and the ability to assess the\n            readiness for this position. Keep in mind that the point C shouldn't necessarily be in the same row as\n            point A meaning a vertical career growth. There may be horizontal growth, which implies exploring related\n            fields staying in the current position but earning more, and multi-skilling, training in multiple skill-sets\n            to perform two or more traditionally separate job functions, development.<br></li>\n    </ul>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1044px\">\n    <div><img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/5e9571b8b13e2d576ef04029_QMyO5RBecD097ucdWYXEXzxTib02_9uSofGlISsGdHfnHsRQt3fNEdQwComdS_ilhxwQtHXU4zi-FfHh-v_QtXW0rjEVfdDLE7N7vyEYz8_bqzjUkxm-01rQ2vxEqg6vv2IuC-FU.png\">\n    </div>\n    <figcaption><em>Eventually! Summary of employee's career path</em>: <em>the</em> <em>current, next, and desired\n        positions, along with the corresponding skill assessments.</em></figcaption>\n    </figure><p>Now that employees plan their career path, they can see who has their desired position and ask these\n    colleagues for information and advice, find out what goals they set for improving skills, how long it took, who was\n    their mentor, and so on.</p>\n    <h2>What do we have as a result?</h2>\n    <p>While small and medium-sized companies (up to 250 employees) may still try to juggle processes (but\n        shouldn't!), for big companies it's even more crucial to automate the processes. Automatization tools\n        can't replace humans in making decisions but can help you gather the required information and assist everyone\n        in the company: employees, managers, HR, and even CEOs.&nbsp <br></p>\n    <p>It's only the beginning of our automatization path. We haven't measured the satisfaction with updated\n        processes yet but we do see the directions to track profit for every role:&nbsp &nbsp <br></p>\n    <p><strong>Employees can</strong>:&nbsp </p>\n    <ul>\n        <li>Visualize the job hierarchy and their current position in it</li>\n        <li>Involve an employee in their structured and regular development: offer education, help them to plan and\n            visualize their career opportunities and direction that follow the needs and experience of the organization\n        </li>\n        <li>Find people who can help them to gain the necessary experience.<br></li>\n    </ul>\n    <p><strong>Managers can:&nbsp </strong></p>\n    <ul>\n        <li>Observe the level of professionalism of their teams</li>\n        <li>Identify employees who asked for promotion and provide help, coaching, and mentorship for them</li>\n        <li>Find the most experienced employees to help with internal education</li>\n        <li>Find the most suitable internal candidates to take open vacancies.<br></li>\n    </ul>\n    <p><strong>HR can:</strong></p>\n    <ul>\n        <li>Assess the speed of promotion in the organization</li>\n        <li>Analyze staffing levels</li>\n        <li>Group employees by desired positions and levels to organize bulk education</li>\n        <li>Make the promotion process transparent and accessible for all employees</li>\n        <li>Prevent demotivation and decreases in employee productivity because of getting stuck in the same position\n            and not understanding career opportunities within the organization.<br></li>\n    </ul>\n    <p><strong>CEO can:&nbsp </strong></p>\n    <ul>\n        <li>Have eyes on general staffing situation of the company and the number of open seats</li>\n        <li>Keep track of the number of employees in the company in total and per job family and position separately\n        </li>\n        <li>See the level of compliance of employees with their positions.<br></li>\n    </ul>\n    <p>You likely started a similar journey earlier than us, and your organization already has an established hierarchy\n        of positions and associated tools. Then you just need to dust them off and improve your flow :) We hope our tool\n        will make your journey smoother and welcome you to managing your company's Career Path with <a href=\" https://app.renaizant.com/\">Renaizant</a>\n        .<br></p>\n    <p>Stay tuned!<br></p>\n</div>"
}