{
  "author": "Hussein Al-attar",
  "domains": "['dev_quality_assurance', 'user_research_design']",
  "language": "en",
  "bgImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/60c712f3696d0adaf4fdf721_MyTicketsApp_Cover.png",
  "title": "Designing Aggregator App from A to Z — Part 1",
  "position": "UI/UX Designer",
  "date": "Wed May 19 2021 08:27:24 GMT+0000 (Coordinated Universal Time)",
  "content": "<div>\n    <p>\n    Almost every movie place in our city offers an app to search for movies and buy tickets. So, you need to use several\n    apps in parallel, you lose time comparing movie sessions and prices to make the right choice. My task was to fix\n    this and make this movie escape easy and convenient. I thought of one and only app that would display all the movie\n    places and movies available. It would also allow for picking the movie from all the possible options in the city and\n    purchasing them online.<br>\n    </p>\n    <p>\n    In this article, I'll share how to design an app and lead you through every stage from user research to mock-up.\n    Learn how to gather the information you need and create a splashing design based on users' pains and preferences.\n    And, good luck with your beginnings :)<br>\n    </p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1600px\">\n    <div>\n        <img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a4c6a92141388b7d2d9fe1_rOQ11ZZYkhE9Vg2brc3x94XaGdOQOuxUr6UbDK_Q2_RGn3JMBmOr_xGuJ6P2qaFQUh09hjAIfy8V9cs9NuBontVyETUHEFCY7Vnlaj5_Xd5pIrzmtDIUQRDVQxDm5U3uVyvn5V_o.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure>\n    <h2>\n        <strong>Stage 1: Designing the product<br></strong>\n    </h2>\n    <p>\n    I attended the <a href=\" https://ux-clan.org/training/\" target=\"_blank\">Digital Product Design</a> course, and\n    my graduation task was to develop a mobile app that would merge all the movie places of all the biggest Ukrainian\n    cities. This app will ease finding a film, movie session, best seats, and buying tickets. I went with the iOS\n    platform for the app.\n    </p>\n    <h4>\n        <strong>Business goal</strong>\n    </h4>\n    <p>\n        Sell movie tickets online<br>\n    </p>\n    <h4>\n        <strong>Business requirements:</strong>&nbsp<br>\n    </h4>\n    <ol>\n        <li>Users have an opportunity to pick films according to the genre, prices, location of a movie place, movie\n            session time, seats available, etc.\n        </li>\n        <li>Users have an opportunity for online ticket purchases.<br></li>\n    </ol>\n    <h4>\n        <strong>Target audience research and analysis</strong><br>\n    </h4>\n    <p>\n        People of 18 - 35 who attend movies a couple times a month due to the pandemic made up my target audience. They\n        use smartphones and the Internet widely, and most of them work in the office.&nbsp <br>\n    </p>\n    <p>\n        In my research I applied the following instruments and sources for gathering the information:<br>\n    </p>\n    <ol>\n        <li>An online survey in Google Forms that I ran on Facebook, Telegram, and via corporate Slack channel.&nbsp\n        </li>\n        <li>Live interview with movie fans.</li>\n        <li>Field research in the movie spot.&nbsp</li>\n        <li>Review and analysis of competitive apps like <a href=\" https://apps.apple.com/ua/app/%D0%BF%D0%BB%D0%B0%D0%BD%D0%B5%D1%82%D0%B0-%D0%BA%D1%96%D0%BD%D0%BE/id593841464?l=ru\"\n            target=\"_blank\">Planeta Kino</a>, <a href=\" https://apps.apple.com/ua/app/fander/id1185465114\"\n            target=\"_blank\">Fander</a>. I gathered feedback from live conversations about the mentioned apps, and\n            checked the feedback on the App Store.\n        </li>\n    </ol>\n    <h3>\n        1. Online survey with Google Forms<br>\n    </h3>\n    <p>\n        I started my research of the target audience with an online survey. In this my friends, colleagues, fellow\n        students and even people I don't really know were of great help. I spread my questionnaire through Facebook,\n        Telegram, and Slack. I used Google Forms for gathering answers, and then вЂ” Excel file for results.<br>\n    </p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1600px\">\n    <div>\n        <img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a4c6aa73388525fb870fce_UYbecSSTNeXh7Fgts8d9TA67cV4cZOWV9yeDgmFgNkO7sre49QezHdWEUCVFx_YDphP2mZEHprkBRKQLbSU3ZOjcTTvQwpVap9B1tLgdY6fQBXKatoq28fpp7lcslSUTQbpDlCFE.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure>\n    <h4>\n        <strong>Questions in my online questionnaire:</strong><br>\n    </h4>\n    <p>\n        1. Why do you usually go to the movies?\n    </p>\n    <p>\n        2. What are your criteria for picking films? How do you buy tickets?\n    </p>\n    <p>\n        3. What obstacles do you face while picking a film, buying and paying for a ticket?<br>\n    </p>\n    <h3>\n        2. Live interview<br>\n    </h3>\n    <p>\n        For this stage I invited people I know and even those I don't really know but they're part of the design\n        community. They agreed to participate after I shared the idea through the official Telegram channel of the\n        design school where I studied.<br>\n    </p>\n    <h4><strong>Questions for the interview:</strong><br></h4>\n    <p>\n        1. Do you attend movies? If yes, then what are you searching for there? If the answer to the first question is\n        no, then I ask 'Why is that?'\n    </p>\n    <p>\n        2. How do you pick films and buy tickets?\n    </p>\n    <p>\n        3. What obstacles do you face while picking a film, buying and paying for a ticket?\n    </p>\n    <p>\n        4. How often do you use your smartphone for that?\n    </p>\n    <p>\n        5. What apps do you usually use?<br>\n    </p>\n    <h4><strong>The outcome from a couple of talks:</strong>'<br></h4>\n    <p>\n        <strong>Interviewee 1</strong>\n    </p>\n    <strong>Name:</strong> Daniil&nbsp\n    <p>\n        <strong>Age:</strong> 28\n    </p>\n    <p>\n        '<strong>How often does he go to the movies</strong>\n    </p>\n    <p>\n        <strong>'</strong>Daniil hasn't been to the movies since the beginning of the pandemic. Before the pandemic,\n        he attended movies from time to time with his family and friends.\n    </p>\n    <p><strong>Motivation</strong></p>\n    <p>He's driven by the opportunity to rest from work and experience positive emotions.&nbsp Daniil loves watching\n        films on a big screen.</p>\n    <p><strong>How he picks movies and buys tickets</strong></p>\n    <p>He checks the title and the cover, reads the description, and watches the trailer. The latter uncovers about 50%\n        of the plot, Daniil says.&nbsp Then, he considers the feedback from the audience online. For picking films and\n        purchasing tickets he goes with a <a href=\" https://apps.apple.com/us/app/%D0%B2%D0%BA%D0%B8%D0%BD%D0%BE-%D0%BF%D0%BE%D0%BA%D1%83%D0%BF%D0%BA%D0%B0-%D0%B1%D0%B8%D0%BB%D0%B5%D1%82%D0%BE%D0%B2-%D0%BE%D0%BD%D0%BB%D0%B0%D0%B9%D0%BD/id757872310\"\n        target=\"_blank\">Vkino</a> app.<br></p>\n    <p><strong>Suggestions on how to improve the service</strong></p>\n    <p>1. Add locations of the movies to the app to ease the choice for visitors.<br></p>\n    <p>2. Add maps to build a route from the visitor's locations to the movie place.&nbsp <br></p>\n    <p>3. Improve an online seats map to clearly show where the screen is.<br></p>\n    <p>4. Connect the app to Apple and Google Pay to ease the purchase process.<br><br></p>\n    <p><strong>Interviewee 2</strong></p>\n    <p><strong>Name:</strong> Sophia&nbsp </p>\n    <p><strong>Age:</strong> 35</p>\n    <p>'<strong>How often does she go to the movies</strong></p>\n    <p>Sophia never attended the movies since the pandemic, and she's not really a huge fan.</p>\n    <p><strong>Motivation</strong></p>\n    <p>Spending time with her dear people, especially with the nephew who loves cartoons. Sophia prefers impressive\n        special effects on a big screen and watching films right after the release.<br></p>\n    <p><strong>How she picks movies and buys tickets</strong>'</p>\n    <p>She checks the trailer on the movies' website or just somewhere on the Internet,&nbsp then вЂ” buys tickets\n        from the official website. Sophia generally finds it convenient unless they have troubles with the website (when\n        it doesn't work for a few days). Then she books tickets through the phone and then purchases them at the\n        movies. She doesn't use apps because that's her partner's prerogative.<br></p>\n    <p><strong>Suggestions on how to improve the service</strong></p>\n    <p>1. Create one and only app that would give information about every single movie place in the city, also вЂ” allow\n        booking and purchasing tickets.<br></p>\n    <p>2. Make it possible to purchase tickets through Apple and Google Pay with no need to add users' data every\n        time.<br></p>\n    <p>3. Make fewer registration steps on the way to the purchase.<br></p>\n    <p>4. Provide an opportunity to buy popcorn and sodas through the app and pick them up at the movies with no queues\n        (we could use a barcode or something like this for payment confirmation).<br><br></p>\n    <p><strong>Interviewee 3</strong></p>\n    <p><strong>Name:</strong> Mariia&nbsp&nbsp </p>\n    <p><strong>Age:</strong> 20</p>\n    <p>'<strong>How often does she go to the movies</strong></p>\n    <p>She's been to the movies a couple of times because of the pandemic. Before she used to go there monthly.</p>\n    <p>'<strong>Motivation</strong>'<br></p>\n    <p> It's a nice way to have fun and relax with friends.&nbsp <br></p>\n    <p><strong>How she picks movies and buys tickets</strong></p>\n    <p>She usually checks the trailer, searches for ads about the film, and considers her friends' feedback. Before\n        she used <a href=\" https://multiplex.ua/cinema/kharkiv/dafi\" target=\"_blank\">Multiplex</a> to pick a movie\n        and purchase tickets as she used to live right next to this movie place. Now she lives downtown and prefers the\n        Planeta Kino&nbsp app. It provides a user-friendly interface, a great variety of films, and an Apple pay payment\n        method.&nbsp </p>\n    <p>She's frustrated because it takes time and effort to switch seats when you book tickets online. After the choice\n        is made, she has to wait for 15-20 minutes till her previous order gets canceled. And someone can book the seats\n        she wants while she's waiting.<br></p>\n    <p><strong>Suggestions on how to improve the service</strong><br>- Organise the catalogue of films the way we can\n        see several options on one screen at once, this speeds up the search. Planeta Kino offers horizontal scrolling\n        and shows just one film on a mobile screen.</p>\n    <p>- Offer an easy way to change the booked seats for other ones before the purchase.<br></p>\n    <h3>3. Field research<br></h3>\n    <p>To feel the frustration users tend to feel while using apps, I communicated with them and tried myself in the\n        role of a user. I visited 2 movie places in my city, Planeta Kino and Multiplex. This way, I was able to observe\n        the visitors, their behavior in front of the checkout, the ticket purchase process, the cashier's behavior, also\n        the tech they're using to provide a better service.<br></p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:900px\">\n    <div>\n        <img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a4c6a95a35bad1845e403e_kdcxokWRD4f4YwSbFnLVZMI6DhlJPVz6eM_XM_bAZ6lJ5CUW0QlLoT9tCvayHYHmP5aojg8FXIKQCfuIAa-QFt-nwIWGPCEHRCoH5PGDNwaVdZ99HcCUKiE_JPrfwE0nLkTa0OjF.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure>\n    <p>I also got myself involved in this process by becoming a customer, I put myself in their shoes, and this helped\n        me experience their journey. I started to understand the idea behind the communication with users, how important\n        it is to feel their frustration to come up with a better solution.<br></p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:640px\">\n    <div>\n        <img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a4c6a936aae43a296606d8_snSpiVfZFzG4i361ndi1l_ZguL_Ljjga4JRK_BV-6VEJnxjudeQRMoALL5bdN8sgs6PRUbEwLd2UYeVfwfNKUjd-JMojAfi1jS0Y6w9Zn7fCCrdW_eJQgM5n62VoSyfxmG-EYqxo.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure>\n    <h3>4. Competitors review and analysis<br></h3>\n    <p>We have many applications for buying movie tickets. And I have selected the most popular and frequently used ones\n        for my analysis: <a href=\" https://apps.apple.com/ua/app/%D0%BF%D0%BB%D0%B0%D0%BD%D0%B5%D1%82%D0%B0-%D0%BA%D1%96%D0%BD%D0%BE/id593841464?l=ru\">Planeta\n        Kino</a>, <a href=\" https://apps.apple.com/ua/app/multiplex-cinema/id1160648734\">Multiplex</a>, and <a href=\"\n                                                                                                                 https://apps.apple.com/ua/app/fander/id1185465114\">Fander</a>\n        .<br></p>\n    <p>I installed these applications on my iPhone SE to analyze and test how they look and work, find their advantages,\n        disadvantages that need to be avoided and, of course, saturate my brain with ideas and inspiration. And at the\n        same time, I analyze user reviews of the applications in the App Store.<br></p>\n    <p>In the next part I'll start working with the user personas for our future product, their goals, needs and\n        problems based on the results that I got earlier from the real users.<br></p>\n    <h4><strong>User profile and requirements:</strong><br></h4>\n    <p>As a result of the research phase, we should collect data on the future users in the form of a persona. I created\n        a persona and listed her (his) frustration points, goals, and needs.<br></p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1600px\">\n    <div>\n        <img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a77fb9eeb30b6f14a5ec83_vV0XF4GoC2Qqls_1uVSQFgliPGLPdK3IMexI32Sqso4JWIYlLLn0hkeqAIy0aAxE1ak6dt6I5Hk9s70gWaV64yg9L7-kAFnHze-ubhvgqK0Nq9MHnQZlEtR7IoOP8o7wCvXvCBzI.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure>\n    <h4><strong>Ideas generation and future product requirements:</strong><br></h4>\n    <p>With the goal and needs of the target audience in mind I've generated ideas to cover each frustration point of\n        the users.<br></p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1600px\">\n    <div>\n        <img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a4c6a955362ee89da12c03_x-zN6UprZkZmEQxxNKgFEmYr1FSR_GU8C3bNpcK1Nxc_SGNFJaK9qXdO_kfKB2jvtIi2cXm4sMXmcR_Wv2tNp0nFZscw-JQlFflIQG7EhJFL-GHb5PzEdEatgwu4O7sg2-OWrbVH.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure>\n    <h4>User story:<br></h4>\n    <p>Designing a future product begins with the user story phase. At this stage, you need to describe the cases where\n        the product will be used by different types of users. And that's what I did.<br></p>\n    <p>In the next part I'll be creating the user stories (scenarios) of the most common cases of how users use the\n        future product from the moment of opening the App till they achieve their goal.<br></p>\n    <p><strong>Story 1: Evening at the movies (Regular user)</strong><br></p>\n    <p>On the weekend, Alexander was thinking about how to spend the evening, somehow go out and have fun. He remembered\n        that he had not visited the movies for a long time and decided to invite his best friend to go with him. Sure\n        thing, the friend agreed :-)</p>\n    <p>Alexander reached for his phone to find tickets online through the app. He checked the posters of the movies\n        playing that day, and the new Justice League caught his eye. He watched the trailer, checked the movie story,\n        and decided to go for it. He chose a movie place that was closest and a suitable session, picked seats for two,\n        and paid for the tickets. Then, he checked the tickets', added them to 'Wallet' for quick and easy access,\n        and closed the app. Finally, time to get ready for the show!<br></p>\n    <p>After a while, Alexander and his friend met at the movies and joined the line to enter the movie hall. Alexander\n        prepared the tickets for scanning in the \"Wallet\". After the check, they took their seats and started watching\n        the movie. BTW, it was a good piece. And Alexander gave it 5 out of 5 when received a request for evaluation\n        from the App.</p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-center\n    \">\n    <div>\n        <img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a4c6a911df140606adf18c_imMiWE1xIzeGdSFzm1CPQPayrn8ceU50kA1bQJUR3CMJBTVT5Gr5CxGiayB98irnxNgFmtFF97YwYD3LpH3igUNQLSbbRYo5RhGDM1f8vZs5g4tahQcAv83E4CxS2Ln7kKbunuQ7.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure>\n    <p><strong>Story 2: Movie premiere (New user)</strong><br></p>\n    <p>It was a usual working day. Alexander was on a lunch break, discussing the upcoming Justice League, which had\n        been added to the future release at the movies. Everyone was looking forward to seeing it. The only way to get\n        tickets for the premiere was to pre-order them online. He picked up his phone, downloaded the application,\n        opened it, skipped the registration, and in no time found the movie he was seeking. He selected the movie place,\n        session, and seats. Before he had a chance to pay for the tickets, the App asked for mandatory registration to\n        complete the purchase. He's registered in one tap with his Apple account. After the registration, he paid for\n        the tickets, checked the ticket details, and closed the application.&nbsp </p>\n    <p>In three weeks, on the movie premiere day, Alexander and his friend met at the movies and stood in line in front\n        of the entrance to the movie hall. Alexander opened the application, went to the 'Tickets' section, and\n        prepared the tickets for scanning.<br></p>\n    <p>After check-in, they entered the movie hall, took their seats, and started watching the movie. Alexander liked\n        the movie very much. After watching, he received a notification from the App asking him to rate the movie. He\n        gave it 5 out of 5.</p>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-center\n    \">\n    <div><img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60a4c6aa2ddd2a47f40867ee_g3031GOYJKO7VaBSO0UM0lTYz7eKOZKpON4rEWo3VO54gWbUOuG0tJfHbtREnLP5vqWdJmC_3GQl6r0cOC15y1oRuQC2GZ-i8QeThcRlirAHQNG8ZZKrIgEnqWLPbMZIm9oQblvi.png\"\n        width=\"auto\" height=\"auto\" loading=\"auto\">\n    </div>\n    </figure><h2>What <strong>I realized as I finished this stage</strong><br></h2>\n    <p>The first thing that came to my mind before starting this course is that it is complicated: how I will do it, it\n        takes time, it's difficult, etc. But as soon as the education started and I started delving into these\n        processes, I realized that no successful product was made based on the business owners', designers', or\n        developers' wishes. They're all based on users' needs. I got not just an experience of a lifetime creating\n        products for users, but also had a lot of fun in the journey!</p>\n    <h2>Tools <strong>applied</strong><br></h2>\n    <ol>\n        <li>I used <a href=\" https://apps.apple.com/us/app/xmind-mind-map/id1286983622\">Xmind</a> to create the mind\n            mapping and the functional structure, it's a very handy app for UX designers, simple and easy to use.\n        </li>\n        <li>I used <a href=\" https://www.figma.com/\">Figma</a> to create the user flow (scenarios), wireframes, and of\n            course the interface UI. It's one of the greatest prototyping tools which is primarily web-based, with\n            additional offline features enabled by desktop applications for macOS and Windows.\n        </li>\n    </ol>\n</div>"
}