{
  "author": "Liliia Piddubna",
  "domains": ["business_analysis", "user_research_design"],
  "language": "en",
  "bgImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/60337f303673a72aac624ba7_Lilia_3.jpg",
  "authorImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/602d15c0394b4a6c41d46a38_Screenshot%202021-02-17%20at%2015.10.10.png",
  "title": "Incorporating user research on live projects — Part 3",
  "position": "UI UX Designer",
  "date": "Wed Feb 17 2021 15:23:07 GMT+0000 (Coordinated Universal Time)",
  "content": "<div class=max-w-full>  <h3><strong>This article is part of a series:</strong></h3>\n    <ul>\n        <li><a routerLink=blog/Incorporating_user_research_on_live_projects___Part_1 class=cursor-pointer\n               target=_blank>Part 1</a>: Context of the Project, User Persona, Search for Participants.\n        </li>\n         \n        <li><a routerLink=blog/Incorporating_user_research_on_live_projects___Part_2 class=cursor-pointer\n               target=_blank>Part 2</a>: Preparation for the Interview, Competitors Research.\n        </li>\n         \n        <li>Part 3: Context of Pandemic, Transcribing, Affinity Diagraming, Report.</li>\n         \n        <li>Part 4: Conclusion, Lessons Learned.</li>\n         \n    </ul>\n     <p>Check out the context and the preparation part of this article in case you missed it. And, moving to the\n        very hands-on section!</p>\n    <h2><strong>Conducting contextual inquiries during the pandemic</strong></h2> <p>Ok, so what about user research\n        in times of a pandemic? Is it even possible? Thanks to technological progress, people now are much better\n        technically equipped, and video calls are not a surprise anymore. The key is preparation and moderation skills\n        while running an interview or a contextual inquiry.</p>\n    <p>We did the following to conduct user research effectively:</p>\n    <ol>\n        <li>Set up video calls. In our case, we had 2 calls in Google Hangouts and 1 in Zoom.</li>\n         \n        <li>Chosen screen and audio recorders.</li>\n         \n        <li>Arranged meetings in advance, sent invitation letters with a short explanation of the purpose.</li>\n         \n        <li>Asked participants to be ready to show some of their notes, the software they use in their workflow, to be\n            ready to share their screens.\n        </li>\n         \n        <li>Prepared a cheatsheet with topics to discuss.</li>\n         \n    </ol>\n     <p>Looking ahead, I want to say that all 3 arrangements went well and productive. On average, inquiries lasted\n        1-2 hours. They were productive and gave lots of insights. The structure of each session was the\n        following:</p>\n    <ol>\n        <li>Introduction. Thanking for giving your time, and asking for consent to record audio and video. Telling\n            more details about the purpose of the study and its structure (1st one - interview, second -\n            observation).\n        </li>\n         \n        <li>Starting with simple questions, such as: What is your role? What's the first thing you do when you come to\n            the office? What are your daily activities?\n        </li>\n         \n        <li>Moving to more complex topics: start talking about frustrations and challenges.</li>\n         \n        <li>Going deeper: discussing specific spheres of work, for example: how do you forecast any budget/workforce\n            losses? What helped you in preventing high turnover? What the lack of data interferes with?\n        </li>\n         \n        <li>Asking to show the process of gathering and analysing data about employees.</li>\n         \n        <li>Observing and making tips.</li>\n         \n        <li>Repeating.</li>\n         \n    </ol>\n     <h2><strong>Transcribing</strong></h2>\n    <p>The next step before we can go to the data analysis, is to transcribe our inquiries. For me, honestly, it was\n        the most boring part of the study, but still crucial 🤷🏻‍. While making a study, we can't\n        manually record all the communication - it's better to take some notes and clarifications to deepen the\n        conversation later. So after we are done with an inquiry, we make a cup of coffee/tea, sit down, play the\n        recording, and start typing. Absolute concentration.</p>\n    <p>On average, each interview was 5-8 pages long. We really got a lot of information - especially in\n        combination with video recordings of participants' workflows.</p>\n    <p>But to find any patterns and tendencies, so that we can form design suggestions, we have to work out the data\n        - in our case, qualitatively. How can we do that?</p>\n    <h3><strong>Qualitative data: processing</strong></h3><h4><strong>Affinity Diagramming</strong></h4> <p>Affinity\n        Diagramming is a method we used while working with qualitative data. The essence of the method is uniting\n        observations, ideas, quotations - everything we have got during our studies into clusters on a basis of\n        similarity and affinity. So we basically make groups of information pieces that have something in common. Then\n        we label these clusters.</p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1440px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d30aedb95e53e379845b0_Screenshot%202021-02-17%20at%2017.04.46.png\n        loading=lazywidth=autoheight=auto>\n    </div>\n            </figure> <p>So what was the process in our case?</p>\n    <p>After transcribing the interviews, I wrote down all the key observations, thoughts, frustrations, and tricks on\n        hundreds of post-it notes. To make the process of sharing deliverables easier (in terms of total remote work\n        with peers), I have chosen the Miro tool.</p> <p>Each color defined a specific participant. I processed each\n        interview separately, and as a result, had huge masses of information gained from inquiries with\n        respondents.</p>\n    <p>It was a real mess, and the next step I should have done - is clustering all these pieces into groups so that\n        we can analyze them, and find common patterns, problems, and needs.</p>\n    <p>The result we had:</p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:3086px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d311c50d1afa87f7b9a8b_Dashboard_Valor_Article.png\n        loading=lazywidth=autoheight=auto>\n    </div>\n            </figure> <h4><strong>Uncovered key problems and needs</strong></h4>\n    <p>It turned out, that <strong>the most crucial challenges</strong> our potential users faced in their everyday\n        activities were the following: </p>\n    <ol>\n        <li>Having data for different types of people analytics in different tools and spreadsheets causes a time\n            increase in processing, comparing, and finding correlations.\n        </li>\n         \n        <li>Too many spreadsheets and different tools make knowledge sharing and transferability between HR department\n            team members complicated.\n        </li>\n         \n        <li>The complexity of storing information (too many steps because of many tools) causes incorrect data about\n            employees.\n        </li>\n         \n        <li>Budget losses caused by lack of the data, such as: absenteeism, burnout, correlating quantitative\n            performance, and engagement, etc.\n        </li>\n         \n        <li>Low level of turnover prediction.</li>\n         \n        <li>It is hard to track effectiveness of recruitment, organisational, and educational programs.</li>\n         \n    </ol>\n     <p><strong>What are the key needs</strong> discovered within the research?</p>\n    <ol>\n        <li>Be valuable among other departments with the help of data-driven approaches and metrics</li>\n         \n        <li>Have data to get resources - budget, employees, programs</li>\n         \n        <li>Keep turnover and retention on a benchmark</li>\n         \n        <li>Measure effectiveness of the programs</li>\n         \n        <li>Keep teams engaged and well-performed</li>\n         \n        <li>Meet forecast goals and revenues</li>\n         \n    </ol>\n     <h4><strong>Brainstorming</strong></h4>\n    <p>Based on a quick review of the clusters, I brainstormed ideas we could bundle into the feature. Note - it is\n        much better to try this activity with your team to collect diverse approaches and solutions. Such workshops\n        help teams be on the same page while working on the discovery and ideation stage of the\n        product/feature/enhancement development, and increase engagement.</p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1752px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d3171edfb057611b4af47_Suggestions_to_features_Valor_Article.png\n        loading=lazywidth=autoheight=auto>\n    </div>\n            </figure> <h4>Report preparation</h4>\n    <p>After this activity, I have moved further to create a detailed report with Key Insights and Design Ideas. In\n        the end, it turned out as an 8-page document that concluded the following sections:</p>\n    <ol>\n        <li>Motivations and Frustration Summary</li>\n         \n        <li>Overview of key topics and functionality ideas for each of them (headcount, data correlations, revenue\n            (quantitative performance), qualitative performance, talent acquisition, turnover, promotions, 1on1s,\n            etc.)\n        </li>\n         \n        <li>Design recommendations to predefined dashboards views for each role (HR, Manager, Regular Employee)</li>\n         \n        <li>Design recommendations to dashboard functionality</li>\n         \n    </ol>\n     <p>Here you can read some pieces of the report:</p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1200px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d332035a63cae6a2a5add_Screenshot%202021-02-17%20at%2017.13.55.png\n        loading=lazywidth=autoheight=auto>\n    </div>\n            </figure>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1200px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d33315a65342f18e62de6_Screenshot%202021-02-17%20at%2017.14.16.png\n        loading=lazywidth=autoheight=auto>\n    </div>\n            </figure> <p>Based on the insights we have worked on the informational structure of the feature so that\n        we can implement it later on in the wireframes.</p>\n    <p><em>Informational structure:</em></p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:3338px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d342436e881bef3b5f207_Dashboard_Ideas_Valor_Article.png\n        loading=lazywidth=autoheight=auto>\n    </div>\n            </figure> <p>The report with supplying materials, as competitors' analysis, initial hypothesis,\n        informational structure, and widget ideas was presented to the product owner and QA lead of the team and then\n        sent to other team members. The next step was wireframes creation. Mostly we focused on such features, as:</p>\n    <p>- Adaptive grids </p>\n    <p>- Multiple dashboards </p>\n    <p>- Customizable widgets </p>\n    <p>- Actionable insights forming.</p>\n    <p>I can give you a small glance on the following work we have done:</p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:2880px\">\n    <div><img src=https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d34b9d09df20364e94a26_sketch.jpg\n              loading=lazywidth=autoheight=auto>\n    </div>\n            </figure>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:2880px\">\n    <div><img src=https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/602d34cd36e88114a6b66b14_showreel.png\n              loading=lazywidth=autoheight=auto>\n    </div>\n            </figure><p>But wireframing is another big part of the process, going apart from the research stage of\n        the project.</p>\n    <h3>Conclusion</h3>\n    <p>Ok, if you're about to run a research, nothing can stop you. And when the pandemic comes - comes help from\n        the technologies. Video calls that you schedule in advance might be even more efficient than live meetings\n        since people do get ready for those and even come on time. Maybe that's because communication became even a\n        more lively need these days :-)</p>\n    <p>If your questions for the interview are ready, prepare yourself for another role on top of an interviewer. You\n        need to moderate the conversation in order to pick up the most valuable grains for your research. This\n        requires attention, so make a cheatsheet with topics to discuss. When ready with this part, you need to\n        transcribe the requirements you gathered. You record, then you transcribe taking all the time you need because\n        this takes time.When all the key observations are at hand, you can ease the process of sharing\n        deliverables by going with the Miro tool. You realize the most crucial challenges of potential users and\n        formulate the key needs. Now it's just a detailed report with Key Insights and Design Ideas left to complete\n        the mission. Good job!</p>\n</div>\n"
}