{
  "author": "Liliia Piddubna",
  "domains": "['dev_quality_assurance', 'user_research_design']",
  "language": "en",
  "bgImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/60337f478f4f155577ece42d_Lilia_4.jpg",
  "title": "Incorporating_user_research_on_live_projects_—_Part_4",
  "position": "UI UX Designer",
  "date": "Wed Feb 17 2021 15:44:00 GMT+0000 (Coordinated Universal Time)",
  "content": "<div>\n    <h3><strong>This article is part of a series:</strong></h3>\n    <ul>\n        <li><a href=\" https://valor-software.com/articles/incorporating-user-research-on-live-projects-part-1.html\"\n            target=\"_blank\">Part 1</a>: Context of the Project, User Persona, Search for Participants.\n        </li>\n        <li><a href=\" https://valor-software.com/articles/incorporating-user-research-on-live-projects-part-2.html\"\n            target=\"_blank\">Part 2</a>: Preparation for the Interview, Competitors Research.\n        </li>\n        <li><a href=\" https://valor-software.com/articles/incorporating-user-research-on-live-projects-part-3.html\"\n            target=\"_blank\">Part 3</a>: Context of Pandemic, Transcribing, Affinity Diagraming, Report.\n        </li>\n        <li>Part 4: Conclusion, Lessons Learned.</li>\n    </ul>\n    <p>Check out the context, the preparation, and the actual research part with transcribing, diagraming and hints on\n        report in case you missed it. Now we have just a conclusion left to make. Thanks for following all the way\n        through the story!</p>\n    <h2><strong>Conclusion</strong></h2>\n    <p>The research gave us an understanding of real user pains and needs. With the help of collected data, we may\n        produce better solutions to resolve those challenges our target audience meet in their daily routine. I have\n        learned tons of facts I couldn't previously imagine about the work of HRs and Team Managers. Gathered insights\n        could help us create a product that will be in demand and highly valuable for those ones who want to create\n        high-performance, profitable, healthy organizations.</p>\n    <p>The whole cycle вЂ” from preparation to insight report writing and gathering requirement to a new feature, took\n        about 3 weeks of work. The 4th one was the start of the wireframes creation phase.</p>\n    <p><strong><em>Lessons learned</em></strong></p>\n    <ul>\n        <li>Sharing with the team is crucial, and UX specialists should find the right words to translate collected\n            insights into design recommendations. I realized that in the future I should dedicate more time to present\n            the result to the development team.\n        </li>\n        <li>All the insights should be later transformed into user stories/jobs-to-be-done format so that the process of\n            user flow creation will be more accurate and easier to validate.\n        </li>\n        <li>In-depth user interviews and contextual inquiries uncover issues that can't be found out just by guerilla\n            studies (blogs, articles, and specific forums exploration), so advocating for this stage is necessary for UX\n            specialists. As a person responsible for product usage, we should find new strategies for getting a\n            user-centered approach into the development process, which means actually going out of the office and\n            talking to/observing users.\n        </li>\n    </ul>\n    <figure class=\" w-richtext-figure-type-image w-richtext-align-fullwidth\n    \" style=\"max-width:1280px\">\n    <div><img src=\" https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/605b34311c35a55009a1c9d9_friendly.jpg\"\n        loading=\"lazy\" width=\"auto\" height=\"auto\">\n    </div>\n    </figure><p>This journey was a great start to incorporating more UX methodology into already existing product teams.\n    I hope my experience will motivate you to start involving user studies in your project and create products that will\n    bring sensible value to the users.</p>\n</div>"
}