{
  "title": "ngx-bootstrap v7.0.0 is officially released!",
  "domains": ["dev_quality_assurance", "sales_marketing", "other"],
  "language": "en",
  "bgImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/60fa8f01dac70bb9ea4da278_Ngx-slide-1.png",
  "date": "Fri Jul 23 2021 09:59:45 GMT+0000 (Coordinated Universal Time)",
  "content": "<div class=\"max-w-full\">\n    <p>\n        We’re happy to announce that ngx-bootstrap v7.0.0 is officially released! The Valor Software team has been working hard to bring you a truly stable and feature-packed release, and now we’re thrilled to share the major updates and new functionality.\n    </p>\n    <h3><strong>In this release:</strong></h3>\n    <p>— Added support of Angular v11 and v12</p>\n    <p>— Refactored ngx-bootstrap to use <a href=\"https://nx.dev/\" target=\"_blank\">Nx</a></p>\n    <p>— Moved towards the support of Bootstrap 5&nbsp;</p>\n    <p>— Added Firebase preview channels</p>\n    <p>— Added ESLint for static code analysis</p>\n    <p>— Updated DateRange / MaxDateRange</p>\n    <p>— Fixed the Modal closing issue</p>\n    <p>— Fixed the btnRadioGroup change</p>\n    <p>— And much more, see the <a href=\"https://gist.github.com/valorkin/729a3c2aabe2a7069d7b7aacb877baea\" target=\"_blank\">release notes</a><br></p>\n\n    <h4>\n        <strong>Angular v11 and v12 support</strong>\n    </h4>\n    <p>\n        We updated ngx-bootstrap to support Angular 11 and 12 in parallel! Now you can easily migrate to the latest versions of Angular.<br>\n    </p>\n    <h4>\n        <strong>Nx-powered development</strong>\n    </h4>\n    <p>\n        The ngx-bootstrap source has been refactored, and now you can see the purpose of each component. Contributing to your holistic development experience, we've applied the Nx framework and decomposed the bootstrap script into modules for better understanding and transparency in use.<br>\n    </p>\n    <h4>\n        <strong>Getting closer to Bootstrap 5 support</strong>\n    </h4>\n    <p>\n        We made great progress in adding Bootstrap 5 support without dropping the support of Bootstrap 4. Although most likely, we'll stop supporting Bootstrap 3. We'll be sure to let you know <strong>if</strong> and <strong>when </strong>it will happen.<br>\n    </p>\n    <h4>\n        <strong>Firebase preview channels for teamwork</strong>\n    </h4>\n    <p>\n        We have enhanced the development process with Firebase preview channels to speed up testing and merging of new features into production. You can yourself try out this functionality and see your team's activities and updates. Also, with a link to the preview results, your QA, or clients can check the new deploy through. Make sure that you have a contributor's status and go ahead.<br>\n    </p>\n    <h4>\n        <strong>Strict typing to clear up the code</strong>\n    </h4>\n    <p>\n        ngx-bootstrap supports strict types, and we hope you'll recognize the benefits of it for your development experience. This approach helps to keep the code clean and clear since everyone in the team sticks to a particular order of code writing. No mess in case someone added something new.<br>\n    </p>\n    <h4>\n        <strong>ESLint for static code analysis</strong>\n    </h4>\n    <p>\n        In this release, we moved from TSLint to ESLint for better code quality and readability.&nbsp<br>\n    </p>\n    <h4>\n        <strong>DateRange / MaxDateRange update</strong>\n    </h4>\n    <p>\n        The DateRange / MaxDateRange processing was updated. Also, we improved the performance of the date picker component.\n    </p>\n    <h4>\n        <strong>The modal closing issue fix</strong>\n    </h4>\n    <p>\n        The issue with modal closing when clicking on the modal scrollbar was fixed.\n    </p>\n    <h4>\n        <strong>The btnRadioGroup change fix</strong>\n    </h4>\n    <p>\n        All fixes related to the issue with the btnRadioGroup change for the buttons component are made! Check out the results!<br>\n    </p>\n    <p>\n        See the <a href=\"https://gist.github.com/valorkin/729a3c2aabe2a7069d7b7aacb877baea\" target=\"_blank\">GitHub ngx-bootstrap v7.0.0. release changelog</a> for a complete list of changes.<br>\n    </p>\n    <h3>\n        <strong>What's coming next:</strong><br></h3>\n    <ol>\n        <li>We have dropdowns planned just like in this <a href=\"https://bootstrap-vue.org/docs\" target=\"_blank\">BootstrapVue Getting Started example</a>. You can see how your changes work (if they do) in a live mode.</li>\n        <li>ngx-bootstrap with Bootstrap 5 support is already on the way. Stay tuned!</li>\n    </ol>\n    <p>\n        Already have ideas for upcoming releases? - Feel free to <a href=\"https://github.com/valor-software/ngx-bootstrap/issues\" target=\"_blank\">open issues</a> or <a href=\"https://github.com/valor-software/ngx-bootstrap/pulls\" target=\"_blank\">pull requests</a>!\n    </p>\n</div>"
}