{
  "title": "Scully Helped us Reach a 99 Lighthouse Score for a B2C Platform",
  "domains": ["dev_quality_assurance", "sales_marketing"],
  "authorImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/5ca74cfb04fdce15ea9266e2_ava-Ruslan%20Ponuzhdayev.jpg",
  "language": "en",
  "bgImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/60d445d24897dc4086b2c80f_Blog-Scully.png",
  "author": "Ruslan Ponuzhdayev",
  "position": "JS Developer",
  "date": "Mon Jul 12 2021 11:06:08 GMT+0000 (Coordinated Universal Time)",
  "content": "<div class=\"max-w-full\"><p> You may have heard of <a href=\"https://jamstack.org/what-is-jamstack/\"\n                                                     target=\"_blank\">JAMstack</a>. It recently entered top\n    charts of technology choice for the web because of its ease of use, performance, and flexibility. Scully, a static\n    site generator, brings JAMstack to the next level of effectiveness because of its Angular nature. Valor Software\n    decided to adopt Scully to make the client's platform fast and really convenient to use.&nbsp <br></p>\n    <p> We\n        sped up the overall page load and increased the platform lighthouse score to 99-100. Also, connecting Google\n        eCommerce Marketing helped us see several areas for improvement on the website and in mobile apps to streamline\n        the\n        user journey. Learn from our experience how you can achieve a boost in website performance and visibility for\n        your\n        project using Scully and Google Analytics. Also, I'm going to help you overcome possible difficulties with\n        integrations since we've already been there :)<br></p> <h4><strong>Who the contributors are</strong></h4>\n    <p> Alexandr Pavlovskiy and Nikita Glukhi made it possible to bring all the described to life. Many thanks for\n        being great team players and for their great contribution to the project.<br></p>\n    <p> Also, Dima\n        Shekhovtsov deserves special thanks for the idea, direction, and technical guidance! </p> <h4><strong>Project\n        background</strong><br></h4>\n    <p> Well, our team's job on this project was to reconsider the B2C platform\n        for a game company. They had an outdated landing, as well as mobile apps that users didn't really want to use.\n        We were on a global mission to understand the current project situation, and then - bring value. </p>\n    <p>\n        The client had no insights in terms of the website load, performance, storage allocation, etc. And you can\n        easily guess what we found once we peeked under the hood (it was a pile of legacy code there). At this point, we\n        understood that something new, quick, and easy to manage needs to be built instead. That's how <a\n            href=\"https://scully.io/\" target=\"_blank\">Scully</a> came into play.<br></p> <h4><strong>What is\n        Scully and how to deploy</strong>в </h4>\n    <p> JAMstack stands for JavaScript, APIs, and Markup. In this\n        kind of architecture, JavaScript runs entirely on the client-side and handles any dynamic programming. Reusable\n        APIs cover all the server-side processes, and Markup is markup (a site generator or Webpack), and it needs to be\n        pre-built.&nbsp <br></p>\n    <p> Scully generates static sites for Angular, those with no backend code, so no\n        API call is needed to get the data from the server. Instead, we put all the content on our pages as data and\n        text and make it available to end users. This <a\n                href=\"https://snipcart.com/blog/angular-static-site-generator-scully\">Scully Tutorial</a> tells you\n        all you need to know for smooth deployment.<br></p> <h4><strong>Now Lighthouse score reaches\n        100</strong><br></h4>\n    <p> We use <a href=\"https://developers.google.com/web/tools/lighthouse\"\n                  target=\"_blank\">Lighthouse</a>, an open-source tool for checking\n        and improving the quality of web pages in this project. You can run it through any webpage for performance,\n        accessibility, SEO, and other audits. On completion, you get a report with suggestions for improvements, and all\n        that is left is bringing those to life :-)<br></p>\n    <p> The Lighthouse score represents the results from\n        performance metrics that the tool gathered based on real website performance data. We considered the score to\n        evaluate the website general performance: whether and how Scully changed the picture. And I can tell that once\n        we switched to Scully, the platform's Lighthouse score grew from 56 to 99-100. This indicator includes\n        performance, accessibility, SEO, and application of best practices, as you can see from the screen below.<br>\n    </p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\\\n    \" style=\"max-width:1551px\">\n        <div><img\n                src=\"https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60b0d1d54875f90c19c209ea_Eh8d9dD7OkG3ODiudMJ8UHZs2OmC87O3sYL3GsMQlcbPmGie0fNi_uqTD3o05BoOmwbb_DbUBxlKjfKUVq2e9FZw9AH_UGHmk73U2wDWOMi3jLABRRX1UjfDqCtWBxzLXvNQx79b.png\"\n                width=\"auto\" height=\"auto\" loading=\"auto\">\n        </div>\n    </figure>\n    <h4><strong>Better Google indexation - how to spot the company in the top</strong><br>\n    </h4>\n    <p> If we remember the basics of the Google search logic, then the crawling stage comes first, to discover\n        publicly available web pages and connected links, and bring this data back to the Google server. Then indexing,\n        when Google tries to understand what the website is about in terms of content, images, video, etc., to\n        categorize the object and put it \"on the right shelf\" in a huge Google index storage. Finally, we have\n        serving and ranking, when in response to a user's query Google goes through its index, searching for the most\n        appropriate and quality answer.<br></p>\n    <p> Angular applications are rendered at runtime, so it takes\n        Google bots longer to recognize the content since they have to execute JS code first. And Scully helps us\n        pre-render each route's HTML content. It generates a static version of each website page and eases the mission\n        for bots to see the content. That's exactly what helped us improve the platform indexing and visibility.<br>\n    </p>\n    <p> Learn more about boosting SEO with the help of Scully from this <a\n            href=\"https://academind.com/tutorials/scully-introduction/#improving-seo-in-angular-apps\"\n            target=\"_blank\">Academind article about SEO optimization in Angular apps</a>.<br></p> <h4><strong>Making\n        the</strong> <strong>overall CSS footprint smaller with Tailwind</strong><br></h4>\n    <p> To remove CSS that\n        we don't need when building for production, we used Tailwind CSS. This CSS framework in the first place lets you\n        easily style your website or app. And what's more important in our case, it helped us to get rid of unused\n        styles and optimize builds' size.<br></p>\n    <p> As creators claim, when removing unused styles with\n        Tailwind, you never end up with more than 10kb of compressed CSS. Learn more about the framework and its worth\n        from the <a href=\"https://tailwindcss.com/docs/optimizing-for-production\" target=\"_blank\">Optimizing for\n            Production material by Tailwind</a>.<br></p> <h4><strong>User growth and stronger\n        involvement</strong><br></h4>\n    <p> Firstly, our release of an Alpha version of the platform tuned by\n        Scully drew users to the product. By product, I mean in-app traits for gamers like a range of different\n        cosmetics, including skins and pets. Scully brought us more visitors and buyers among those who already played\n        the game and knew about the platform.<br></p>\n    <p> Another part of the audience came because of better SEO\n        optimization. Optimized content made the platform visible and helped new users find the website. You can see the\n        situation before and after from the screen below (please, don't mind the red area, it shows the moment of\n        deployment when we couldn't track the users' activity).<br></p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\\\n    \" style=\"max-width:1600px\">\n        <div><img\n                src=\"https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60b0d1d5b45c99179c4dad71_pjjkxhvVDowJElf_ztEvzjnkmRdeziJG6VYbO_Zr6mjvUxUgnOTH7GhDc_tu7Hkh05N31S0L-f6HMf5LJ9901a3_ff5oQmMGZYGqqsEfrQ3Ui3OfDIDFkt1EDC0BhTv5H1onWPRg.png\"\n                width=\"auto\" height=\"auto\" loading=\"auto\">\n        </div>\n    </figure>\n    <p><strong>As a result,</strong> from the moment we released the new platform version, sales\n        grew twice.&nbsp <br></p> <h4><strong>Integration of Google eCommerce Marketing</strong><br></h4>\n    <p> The eCommerce part of Google Analytics is what you definitely want to apply to gather insights on user\n        behavior and preferences. You can also understand who makes up your core audience, if that's what you lack, and\n        then - build more efficient marketing campaigns. eCommerce gives you access to your audience's gender, age,\n        geographical location. The only thing you should take care of to obtain needed data is <a\n                href=\"https://tagmanager.google.com/\" target=\"_blank\">tags</a>. You've got to manage them right when\n        setting up analytics. The following links will help you tune your tags for enhanced eCommerce:<br></p>\n    <ul>\n        <li><a href=\"https://www.analyticsmania.com/post/datalayer-push/\" target=\"_blank\"><strong>dataLayer.push\n            with examples</strong></a><br></li>\n\n    </ul>\n\n    <ul>\n        <li><a href=\"https://www.analyticsmania.com/post/google-analytics-user-id-with-google-tag-manager/\"\n               target=\"_blank\"><strong>A Guide to Google Analytics User ID in Google Tag Manager</strong></a><br></li>\n\n    </ul>\n\n    <ul>\n        <li><a href=\"https://www.analyticsmania.com/post/ecommerce-tracking-with-google-tag-manager/\"\n               target=\"_blank\"><strong>Set Up Ecommerce Tracking with Google Tag Manager: Full\n            Guidegle-tag-manager/</strong></a><br></li>\n\n    </ul>\n\n    <ul>\n        <li><a href=\"https://www.simoahava.com/analytics/enhanced-ecommerce-guide-for-google-tag-manager/\"\n               target=\"_blank\"><strong>Enhanced eCommerce Guide for Google Tag Manager</strong></a><a\n                href=\"https://www.simoahava.com/analytics/enhanced-ecommerce-guide-for-google-tag-manager/\"></a><br>\n        </li>\n\n    </ul>\n    <p> We integrated Google eCommerce tracking and provided our clients with the data they needed for planning\n        future website and mobile apps upgrades. One of the most important things that we started to track is the\n        checkout process - from the moment when the product falls into the basket through filling in the form for\n        online payment to the actual purchase. Clients could realize what may stop a user from a purchase, what stands\n        in the way of accomplishing the checkout. Now they have a data-driven basis for targeting bigger goals in the\n        future.<br></p> <h4><strong>Bridging Google Analytics' tags and your Scully platform</strong><br>\n    </h4>\n    <p> Earlier we added a complete JavaScript tracking-code snippet into the HTML to our platform (just like\n        described in this <a href=\"https://ppcexpo.com/blog/where-is-the-google-analytics-code\" target=\"_blank\">PPCexpo\n            material</a>). But when we switched to Scully and went on connecting Google Analytics to the Scully website,\n        a conflict between Google Tag Manager and HTTPS packages arose. <strong>So, we created a plugin to pre-build\n            this connection for Scully to add the piece of code for Google Analytics without any modifications:</strong><br>\n    </p>\n    <pre>\n        <code>\n            import {{'{'}} registerPlugin, getMyConfig } from '@scullyio/scully';\nexport const GoogleAnalytics = 'googleAnalytics';\nexport const googleAnalyticsPlugin = async (html: string): Promise => {{'{'}}\n    const googleAnalyticsConfig = getMyConfig(googleAnalyticsPlugin);\n    if (!googleAnalyticsConfig || !googleAnalyticsConfig['globalSiteTag']) {{'{'}}\n        throw new Error('googleAnalytics plugin missing Global Site Tag');\n    }\n    const siteTag: string = googleAnalyticsConfig['globalSiteTag']; // your gtmTagId\n    const googleAnalyticsScript = `\n      // your GA script code here\n    `;\n    return html.replace(/<\\/head/i, `${{'{'}}googleAnalyticsScript} [];\n                registerPlugin('postProcessByHtml', GoogleAnalytics, googleAnalyticsPlugin, validator);\n        </code>\n    </pre>\n    <p> Use <a href=\"https://developers.google.com/tag-manager/quickstart\"\n               target=\"_blank\">this instruction</a> for implementing Google Tag Manager\n        on your website. That's where you get the following piece of code from: </p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\\\n    \" style=\"max-width:1308px\">\n        <div><img\n                src=\"https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60bf4e6e2cdce6412d434a78_Screenshot%202021-06-08%20at%2013.58.26.png\"\n                loading=\"lazy\" width=\"auto\" height=\"auto\">\n        </div>\n    </figure>\n    <p> And <a href=\"https://www.analyticsmania.com/post/google-tag-manager-id/\"\n               target=\"_blank\">this article</a> tells how to get your Google Tag Manager ID.\n    </p>\n    <p><strong>Here's where you should place the plugin</strong><br></p>\n    <p> The Scully config file is\n        generated automatically when we connect Scully to our Angular app. It is located in the root folder with\n        package.json. Of course, we get a default Scully config, and then we should customize it for our project. This\n        <a href=\"https://medium.com/ngconf/a-guide-to-custom-scully-plugins-5558993fd3f8\" target=\"_blank\">Guide to\n            custom Scully plugins</a> gives good advice for customizing plugins to your needs.<br></p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\\\n    \" style=\"max-width:1468px\">\n        <div><img\n                src=\"https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/60b0d1d51c5fb97963e98cc3_2a4JxNNsn40mrnC1FODeMj6l1fsgYR2oCnVhykr7yvcjcZBmfMtmY3I-yFsuobT3RGRW17sQyEg2iIbhSVGs3RRhbyywxzM30dSuEBSCJ8jFRhBGgMTsnsOr6SfF0r6I9pi_FIVu.png\"\n                width=\"auto\" height=\"auto\" loading=\"auto\">\n        </div>\n    </figure>\n    <h4><strong>Summary<br></strong></h4>\n    <p> This switch to JAMstack and Scully gave us a\n        tremendous amount of benefits, even those both we and the client didn't expect to get. For example, it was a\n        surprise that we'll have better Google indexing.<br></p>\n    <p> From my point of view, the main gain for\n        this project (just like for most of them) is transparency. With such a clear structure and interaction between\n        frontend and backend, you know exactly what's happening on your Scully website. And when you know, you can\n        react, and actually handle complexities that arise.&nbsp <br></p>\n    <p> Sure, there's still much work to\n        do, but we have bright perspectives. We plan to deepen tracking of eCommerce indicators, since this will give\n        the client more ground for new business turns. Also, we'll be working on mobile apps to increase users'\n        engagement even more!<br></p>\n    <p> Here I shared our first experience and thus impressions from the\n        technology. Hopefully, you'll find the story useful. Please, don't hesitate to share your feedback, give advice,\n        or contact <a href=\"https://valor-software.com/contact.html\" target=\"_blank\">Valor Software</a> to give your\n        business a boost!</p> <h4><strong>Useful links</strong></h4>\n    <p> 1. <a\n            href=\"https://snipcart.com/blog/angular-static-site-generator-scully\" target=\"_blank\">Scully\n        Tutorial</a></p>\n    <p> 2. <a href=\"https://snipcart.com/blog/angular-static-site-generator-scully\"\n              target=\"_blank\">Optimizing for Production material by Tailwind</a></p>\n    <p> 3. <a href=\"https://academind.com/tutorials/scully-introduction/#improving-seo-in-angular-apps\"\n              target=\"_blank\">Academind article about SEO optimization in Angular apps</a></p>\n    <p> 4. <a\n            href=\"https://www.simoahava.com/analytics/enhanced-ecommerce-guide-for-google-tag-manager/\"\n            target=\"_blank\"><strong> </strong>Enhanced eCommerce Guide for Google Tag Manager</a></p>\n    <p> 5. <a\n            href=\"https://medium.com/ngconf/a-guide-to-custom-scully-plugins-5558993fd3f8\" target=\"_blank\">Guide to\n        custom Scully plugins</a></p>\n</div>\"\n"
}