{
  "author": "Olga Ievdokymenko",
  "domains": ["sales_marketing"],
  "language": "en",
  "authorImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/5fb3cfd99136afe1c0b815c0_evdokimenko.jpeg",
  "bgImg": "https://assets.website-files.com/5c4c30d0c49ea6746fafc90c/5fb294f066bfcd3e42aabeb4_Valor-software-outsourcing-blog-cover.png",
  "title": "Why you might want to switch to Time and Material from Fixed Price",
  "position": "Marketing Content Manager",
  "date": "Mon Nov 16 2020 13:15:58 GMT+0000 (Coordinated Universal Time)",
  "content": "<div class=max-w-full><p>You have your project, your idea, your metaphorical baby that you want to create. You're\n    ready to set out on the journey of creating it, and you start looking for a team to join you in bringing this idea\n    to reality. You need to know how much it's going to cost and you start collecting bids. You don't want to get into\n    the trap of a never ending project that just spirals out of control so you go for fixed bids.<br></p> <p>We can\n    all acknowledge that as human beings we are rarely 100% accurate with exactly what we want to achieve at the onset\n    of any project. It is even less likely that the desired outcome will not change in any way throughout the duration\n    of the project.<br></p> <p>Furthermore you most likely appreciate the freedom to adjust and react to new\n    information, context, and market changes. This is where a fixed price model becomes akin to a wooden coffin buried\n    6 feet under the ground that restrains the actions for both you and your new friends, the development team. Inside\n    the coffin your only source of light is burning money. While Fixed Price contracts will most likely always exist,\n    there are other approaches one should consider.<br></p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1280px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/5fb29e5e30e5337ca8fca8bd_Bride-Valor-Software-Blog.jpg\n        loading=lazy width=auto height=auto alt=Valor Software blog post about fixed price vs T&M -\n        pic1>\n    </div>\n        </figure><h3>Why do brides tend to cry in the morning before the ceremony</h3> <p>Another analogy comes to\n        mind that hits close to home for me. Lately it seems as if all of my friends are getting married. As I watch\n        them prepare for the big day, oddly enough it is really analogous to our work. This example demonstrates at\n        what points a business decision (in one case I witnessed, makeup style) may no longer be the desired\n        direction. It's a wedding day. The long awaited time has come, and your makeup artists came to surpass your\n        prom makeup experience and make you look stunning. You've already discussed what you want to be like at the\n        end, it was weeks ago, and you think it's still 100% relevant. Then, they turn you away from the mirror, and\n        turn you back in two hours when the makeup is ready and your eyelashes nearly touch the sky. You definitely\n        like the result, except a pink blusher that is now out of fashion, and a lips' colour not matching your skin\n        these days. Well, you definitely could think of something more to modify, unless you had time.<br></p> <p>\n        There's a list of projects that due to their specifics might make you feel just like a bride from my example\n        - not quite satisfied with the end result, because your initial requirements and expectations got expired.</p>\n     <h3>On what condition does Fixed Price work best</h3> <p>I must admit, there's a particular range of projects\n        where a fixed price model fits the bill. It is all about the degree of the unknown in your project, the\n        probability and the volume of inevitable change, the length of time and effort required. If you're able to\n        describe the requirements in detail, consider all you need, document it, and communicate it to your vendor -\n        it sounds like a healthy case for a sound fixed price. Also, this approach allows you to meet a strictly\n        limited budget, which is crucial for governmental projects. In any case, according to my experience, this\n        approach makes you deviate from the initial scope by roughly 30% of costs and features in order to meet new\n        requirements that always appear on the run. You make a change list, approve it, and get updates that were not\n        included in the initial scope. And this is a great option, so better keep it for yourself.<br></p> <p>When\n        it comes to higher levels of unknown or a more long-term engagement, a fixed price approach will force your\n        vendor to consider all the possible risks at the estimation stage, which will certainly influence the final\n        project cost. Also, acceptance testing will take you and a team more time, and this will influence the project\n        duration.</p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1200px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/5fb2980a66bffe32498f25af_Leo-Wolf-Valor-Software.jpg\n        loading=lazy width=auto height=auto alt=Valor Software blog post about fixed price vs T&M -\n        pic2>\n    </div>\n        </figure><p>It's impossible to plan and estimate the solution development for more than a 3-months period from\n        the start date, so you either split it into phases, or switch to another development approach at once. If you\n        play big, you might want to consider a more changes-providing approach.<br></p> <h3>Rise of the SAAS\n        platform format - take advantage of pay-as<strong>-</strong>you-go</h3> <p>The world is currently drawn to\n        the <a href= https://en.wikipedia.org/wiki/Software_as_a_service target=_blank>software as a\n        service</a> (SAAS) platform format, where you use what you use, and pay only for this. Finally, you get\n        released from ready-made packages with items you're not going to apply. You don't have unneeded storage space,\n        memory gigabytes, apps features, or screens. If this sounds like something relevant for you, you'll probably\n        enjoy what a time and material software development model has to offer: pay for what's done, according to your\n        latest request.</p> <p>This project development flow allows staying abreast of current tendencies, latest\n        technologies, and best practices that may boost your solution. What is crucial is that you and a team react to\n        changing realities, and adjust to win users' preference. Moreover, you may request particular experts'\n        engagement for the crucial project stages: QA engineers, business analysts, <a href= https://en.wikipedia.org/wiki/Software_as_a_service\n        target=_blank>DevOps</a> experts, UI/UX designers, technical and content writers.</p> <h3>Time and\n        material being good for expectation management</h3> <p>As <a href= https://medium.com/@benek?source=post_page-----c70427aab628--------------------------------\n        target=_blank>Benek Lisefski</a> said in <a href= https://medium.com/@benek?source=post_page-----c70427aab628--------------------------------\n        target=_blank>the development flow article</a>, a whole application development process is not what you\n        can estimate from the start. It has myriades of variables, so the estimation will be optimistic or\n        pessimistic. And you lack tools to influence, as well as a development team might not be able to manage your\n        expectations.<br> </p> <p>When it comes to impacting the development flow and the code flash on the run, T&M\n        with dedicated developers will better meet your needs. Going T&M, you get a preliminary estimation for cost\n        and duration, and you get flexibility to accustom the solution to the modern world. You update and specify the\n        requirements at the end of each stage (from a couple of weeks to a month), depending on what you got from a\n        previous stage. Each sprint effects the next one estimation-wise, you pay no extra money, they develop no\n        needless modules.</p> <h3>Make the predictions you can trust: predictability review</h3> <p>Too many factors\n        will influence the end result: quality of documentation, vendor's team expertise, their good will to make you\n        a reliable client, internal processes and changes, and many more. It's always a risk. T&M gives you facilities\n        for predictability. You have estimations, access time and task tracking systems, check code updates, and know\n        when the next release is coming.<br></p>\n    <figure class=\"w-richtext-figure-type-image w-richtext-align-fullwidth\" style=\"max-width:1600px\">\n    <div><img src= https://uploads-ssl.webflow.com/5c4c30d0c49ea6746fafc90c/5fb29c198973d6ff4e163be0_FortuneTeller-Valor-Software-Blog.jpg\n        loading=lazy width=auto height=auto alt=Valor Software blog post about fixed price vs T&M -\n        pic3>\n    </div>\n        </figure><p>Having your dedicated team members on board, you can expect that they will do their best to meet\n        your project goals and timelines, take overtimes when critical, and find a better technical and business\n        option in case competition intensifies.\n    <h3>Availability, communication, and team involvement</h3> <p>On top of the flexibility and predictability that\n        T&M gives, you outsource developers that work on your project exclusively. At least that's how it is supposed\n        to be and the way <a href= https://valor-software.com/approach.html target=_blank>Valor Software</a>\n        approaches projects. When a team has a particular scope for one customer they work on daily, they pay all the\n        attention, skills, and afterhours for solving tasks of this particular project. No distractions - higher\n        effectiveness.<br></p> <p>Your dedicated engineers treat your project, your company, and your business as part\n        of their life. They care about the results and the way the market meets the solution, and they will stop you\n        from making wrong turns if you allow them. You'll appreciate this approach.<br></p> <p>You also get direct\n        access to your remote dedicated team, you communicate when you need and as often as your project requires. So,\n        make sure your vendor provides English-speaking engineers to use the value of face-to-face meetings.<br></p>\n    <h3>Access unique brains, grow your team, utilize vendor's tech expertise</h3> <p>A fixed price approach is not\n        about personalities, it's about input and output. At this restaurant, you make an order with no pics in the\n        menu - you get whatever they bring you. You might not have a chance to talk to a chef cook if, let's say,\n        you want to shake hands. Actually, you're not supposed to know who worked on your project. It may become a\n        bonus for small projects that need to be brought to life ASAP, but what about larger solutions?<br></p> <p>\n        With T&M, you know the team, you approve it, you grow it when the project requires. I've already outlined the\n        benefits from communication, and here I want to stress the importance of access to the market. It gives you a\n        chance to find the ones you require, even if your project is extremely demanding, and the technology is rare.\n        Your software development vendor will recruit the right engineer, and will make its best to make him stay with\n        your project for as long as needed.</p> <h3><strong>Think twice, then go with Valor Software</strong><br></h3>\n     <p>Compare the approaches, consider the most suitable one, and go with it, knowing the consequences. I hope\n        after reading all the above, you'll come to the same conclusion as me: if your desired solution is more\n        complicated than a non-interactive landing page or a blog, leave yourself a space for change.</p> <p>You've\n        got to have enough vision and responsibility to take care about the way your solution is born and developed.\n        Follow the link to get a fact-driven estimate from my colleagues at Valor Software: <a href= https://valor-software.com/contact.html\n        target=_blank>https://valor-software.com/contact.html</a></p> <p>Special thanks to contributors and\n        reviewers of the article: <a href= https://www.linkedin.com/in/valorkin/ target=_blank>Dmitriy\n        Shekhovtsov</a>, <a href= https://www.linkedin.com/in/zackarychapple/ target=_blank>Zackary\n        Chapple</a>, <a href= https://www.linkedin.com/in/nikitanuts/ target=_blank>Nikita Demchenko</a>, <a\n                href= https://www.linkedin.com/in/viktoria-lurye-4b7b41155/target=_blank>Viktoria Lurye</a>.\n    </p>\n</div>\n"
}