{
  "name": "Ashes Of Creation",
  "link": "https://ashesofcreation.com/",
  "feedback": "Steven Sharif",
  "sortTechnologies": ["aws", "nest_js"],
  "previewImg": "assets/img/bg-img/ashes_page/header_bg_resp.png",
  "description": "A web platform and an online shop for the game studio working on the MMORPG Ashes of Creation.",
  "goals": [],
  "solutions": [],
  "outcome": "",
  "headerImg": "assets/img/bg-img/ashes_page/header_bg.svg",
  "sortServices": ["web", "ui"],
  "aspects": {
    "type": [
      "B2B",
      "SaaS",
      "Startup"
    ],
    "country": [
      "USA"
    ],
    "technology_stack": [
      "Node.js",
      "AWS",
      "Nest.js",
      "PostgreSQL",
      "MongoDB",
      "Sentry",
      "Azure PlayFab"
    ],
    "services_provided": [
      "Frontend"
    ]
  },

  "background": [
    "Intrepid Studios, authors of the most anticipated MMORPG – Ashes of Creation, inspire unity and bring people together through the game. Avoiding pay-to-win or cash grab elements, they simply create games the way people want them to be, with great respect and devotion to the community.",
    "“I want to see the players dictate the direction of our story. I want to see the AoC world adapts and reacts to the player’s actions. Most importantly, I want to see a game built by gamers FOR gamers.” – says Steven Sharif, the Creative Director of Ashes of Creation, describing what stands behind the idea of AoC.",
    "Ashes of Creation hasn’t just offered a beautiful fantasy world with over 100 locations but redefined the MMORPG genre giving the community the power to participate in the direction of the world's development and influence literally every aspect of the game. However the Ashes of Creation universe is more than just the game client, it also needs a great website for people to discover the game, dive deeper into the lore, meet the community and pick up the latest merch. This is the direction where Valor’s team had a big time of success."
  ],
  "challenge": [
    "Ashes of Creation has a huge number of fans, and we wanted to ensure they get incredible experience not just with the game, but the website around Ashes of Creation. The existing solution couldn’t meet the company’s goals for growth and represent the brand properly after it matured. We helped Ashes of Creation address their community’s willingness to connect, purchase merch and cosmetics and launched a new website that can grow together with the brand.",
    "Also, as AoC has matured, the technologies and services they've been using have naturally evolved. Some are no longer supported, and some became too expensive or irrelevant for the company. From this occurs the second part of our mission – to refactor the codebase, remove expired services, and optimize the number of servers used, correspondingly – the budget associated with maintenance."
  ],
  "deliverables": [
    {
      "text": "A Brand New UI/UX and a New Web Platform",
      "description": "We took our in-depth knowledge of the MMORPG’s industry and our knowledge of eCommerce and web development and brought those together to give our customers a new web platform.",
      "comparisons": [
        {
          "beforeImg": "assets/img/bg-img/ashes_page/login_old.png",
          "afterImg": "assets/img/bg-img/ashes_page/login_new.png"
        },
        {
          "beforeImg": "assets/img/bg-img/ashes_page/items_old.png",
          "afterImg": "assets/img/bg-img/ashes_page/items_new.png"
        },
        {
          "beforeImg": "assets/img/bg-img/ashes_page/checkout_old.png",
          "afterImg": "assets/img/bg-img/ashes_page/checkout_new.png"
        }
      ],
      "technologies":  [
        "javascript",
        "scully",
        "g_analytics",
        "ecommerce_marketing",
        "tailwind"
      ],
      "impact": [
        "Better reliability for updates",
        "Performance that matches the latest web standards – 99 Lighthouse score",
        "Improved UX",
        "Better Google indexation",
        "Less complexity and deeper integrations with third-party services, e.g. Discord"
      ],
      "centerButton": {
        "text": "Visit a case study to learn more",
        "link": "/projects"
      }
    },
    {
      "text": "Modernization of a Single Sign-On Authentication (SSO)",
      "description": "As the project has grown remarkably, we had to ensure that their authentication and authorization setup can guarantee the highest security and data protection. Aiming to reduce the number of databases that added complexity to their existing solution, increase app security and eliminate obsolete codebase, we decided to build a new single sign-on (SSO).",
      "technologies": [
        "node_js",
        "aws",
        "nest_js",
        "postgre_sql",
        "mongo_db",
        "sentry",
        "azure_play_fab"
      ],
      "impact": [
        "Higher readability and reliability of the platform",
        "Improved interactions with the database and SSO calls",
        "Higher platform visibility and improved troubleshooting"
      ],
      "bgImg": "assets/img/bg-img/ashes_page/sso_bg.svg"
    },
    {
      "text": "Transition to Nx Monorepo",
      "description": "Embracing code sharing between applications, simplified deployments, and generally less pain in life, we\"ve introduced Nx. While standardizing code and libraries, Nx eliminates a chance for \"spaghetti\" code and allows to store all the applications of AoC in one shared repository. This and the fact that Nx give engineers exclusive control of builds and dependencies enhanced the team performance. Now, instead of testing the whole platform, they can build and test only the projects affected by the change in Nx Monorepo.",
      "bgImg": "assets/img/bg-img/ashes_page/nx_bg.svg"
    },
    {
      "text": "Automated content updates",
      "description": "More importantly, we’ve automated the flow for content updates, allowing Content Managers to push updates from Contentful directly to a new Scully build once they press Publish. Before, it was impossible without engineers who had to manually clear cache and make a deployment.",
      "technologies": [
        "contentful",
        "scully",
        "github_actions"
      ],
      "impact": [
        "Advanced automation and faster content updates",
        "Reduced number of repositories",
        "Code is modular and can be reused",
        "Code structure and quality meets industry best practices",
        "Improved code documentation, faster onboarding for new engineers"
      ],
      "bgImg": "assets/img/bg-img/ashes_page/automated_bg.svg"
    },
    {
      "text": "Deployment of Payment Systems",
      "description": "To provide users with more payment options, we integrated PayPal and Stripe payment systems into the AoC web platform.",
      "impact": [
        "Saved money for processing charges, as Xsolla, their existing solution, charges 5% of transactions",
        "With these integrations, we increased the availability of AoC products for users located worldwide",
        "Also, we increased the security of online purchases as Stripe and PayPal prevent credit card fraud."
      ],
      "bgImg": "assets/img/bg-img/ashes_page/payment_bg.svg"
    }
  ]
}

